In [1]:
from database.connection import get_connection

conn = get_connection()

conn.execute("SELECT COUNT(*) FROM pokemon").fetchall()

conn.close()

In [2]:
from database.connection import DB_PATH

print(DB_PATH)
print(DB_PATH.resolve())

C:\1. Projects\pro_projects\poke-team-builder\data\pokemon.duckdb
C:\1. Projects\pro_projects\poke-team-builder\data\pokemon.duckdb

In [8]:
import duckdb
from database.connection import DB_PATH

con = duckdb.connect(DB_PATH)

# tables
con.sql("SHOW TABLES").df()

# row count
con.sql("SELECT COUNT(*) FROM pokemon").df()

# # preview
con.sql("SELECT * FROM pokemon LIMIT 10").df()

   id        name  base_experience  height  weight
0   1   bulbasaur               64       7      69
1   2     ivysaur              142      10     130
2   3    venusaur              236      20    1000
3   4  charmander               62       6      85
4   5  charmeleon              142      11     190
5   6   charizard              240      17     905
6   7    squirtle               63       5      90
7   8   wartortle              142      10     225
8   9   blastoise              239      16     855
9  10    caterpie               39       3      29

In [2]:
con.sql("SHOW TABLES").df()

Empty DataFrame
Columns: [name]
Index: []